src/Documents/КАЗ_РеестрПлатежей/КАЗ_РеестрПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_РеестрПлатежей</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <attributes>
    <name>ДатаРеестра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьОплаты</name>
    <type>
      <types>CatalogRef.КАЗ_ОчередиПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРеестра</name>
    <type>
      <types>EnumRef.КАЗ_СтатусыРеестра</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.КАЗ_СтатусыЗаявки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ФактическиеПлатежи/КАЗ_ФактическиеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ФактическиеПлатежи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_РеестрПлатежей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Заявки.Количество() = 0 Тогда
		Сообщить("В реестре платежей нет заявок.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;

	Для Каждого СтрокаЗаявки Из Заявки Цикл

		Если Не ЗначениеЗаполнено(СтрокаЗаявки.Заявка) Тогда
			Сообщить("В табличной части есть строка без заявки.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ДанныеЗаявки = СтрокаЗаявки.Заявка;

		Движение = Движения.КАЗ_ФактическиеПлатежи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заявка = СтрокаЗаявки.Заявка;
		Движение.Контрагент = СтрокаЗаявки.Контрагент;
		Движение.Сумма = СтрокаЗаявки.Сумма;

		ОбъектЗаявки = СтрокаЗаявки.Заявка.ПолучитьОбъект();
		ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена;
		ОбъектЗаявки.Записать();

	КонецЦикла;

КонецПроцедуры
